1mem/New folder/New folder/ab_full_log.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.471 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.12 [#/sec] (mean)
Time per request:       471.002 [ms] (mean)
Time per request:       471.002 [ms] (mean, across all concurrent requests)
Transfer rate:          0.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      236  236   0.0    236     236
Processing:   235  235   0.0    235     235
Waiting:      232  232   0.0    232     232
Total:        471  471   0.0    471     471
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.497 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.01 [#/sec] (mean)
Time per request:       497.216 [ms] (mean)
Time per request:       497.216 [ms] (mean, across all concurrent requests)
Transfer rate:          0.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      251  251   0.0    251     251
Processing:   247  247   0.0    247     247
Waiting:      247  247   0.0    247     247
Total:        497  497   0.0    497     497
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.466 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.14 [#/sec] (mean)
Time per request:       466.270 [ms] (mean)
Time per request:       466.270 [ms] (mean, across all concurrent requests)
Transfer rate:          0.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      235  235   0.0    235     235
Processing:   231  231   0.0    231     231
Waiting:      231  231   0.0    231     231
Total:        465  465   0.0    465     465
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   24.757 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    4.04 [#/sec] (mean)
Time per request:       2475.723 [ms] (mean)
Time per request:       247.572 [ms] (mean, across all concurrent requests)
Transfer rate:          1.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      220  242  10.3    241     277
Processing:   242 2084 389.4   2183    2355
Waiting:      235 1225 602.7   1223    2233
Total:        478 2326 390.1   2422    2597

Percentage of the requests served within a certain time (ms)
  50%   2422
  66%   2450
  75%   2459
  80%   2464
  90%   2478
  95%   2485
  98%   2490
  99%   2597
 100%   2597 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.089 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.99 [#/sec] (mean)
Time per request:       2508.928 [ms] (mean)
Time per request:       250.893 [ms] (mean, across all concurrent requests)
Transfer rate:          1.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      223  246  13.7    244     297
Processing:   236 2107 403.8   2199    2477
Waiting:      234 1389 621.4   1441    2315
Total:        467 2353 406.5   2446    2727

Percentage of the requests served within a certain time (ms)
  50%   2446
  66%   2485
  75%   2505
  80%   2512
  90%   2555
  95%   2598
  98%   2638
  99%   2727
 100%   2727 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.964 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.85 [#/sec] (mean)
Time per request:       2596.437 [ms] (mean)
Time per request:       259.644 [ms] (mean, across all concurrent requests)
Transfer rate:          0.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      221  255 100.9    243    1245
Processing:   245 2193 516.4   2207    3301
Waiting:      225 1257 705.2   1197    3286
Total:        482 2447 528.2   2450    3542

Percentage of the requests served within a certain time (ms)
  50%   2450
  66%   2472
  75%   2492
  80%   2502
  90%   3440
  95%   3514
  98%   3534
  99%   3542
 100%   3542 (longest request)